import time 

DOUBLE_WEEK = 1209600
WEEK = 604800

def pick_schedule(time_now = int(time.time()), time_from=1746997200):
    deviation = (time_now - time_from)%DOUBLE_WEEK
    return schedule_even if deviation < WEEK else schedule_odd



schedule_odd = {
        'Monday': {
            3: {'group1':'Лабораторна Комп`ютерна схемотехніка Клушин Ю.С., 509 V н.к.',
                'group2':'Організація баз даних Колодчак О.М., 505а1 V н.к.'},
            4:{'group1':'Організація баз даних Колодчак О.М., 505а1 V н.к.',
                'group2':'Лабораторна Комп`ютерна схемотехніка Клушин Ю.С., 509 V н.к.'},
            },
        'Tuesday': {
            3: {'group1': 'Моделювання комп`ютерних систем Будз І.С., 505б1 V н.к.',
                'group2': 'Лабораторна Алгоритми та моделі обчислень Колодій З.О., 505б2 V н.к.'},
            4: {'group1': 'Лабораторна Алгоритми та моделі обчислень Колодій З.О., 505б2 V н.к.',
                'group2': 'Моделювання комп`ютерних систем Будз І.С., 505б1 V н.к.'},
            },
        'Wednesday' :{
            1: {'group1': 'Системне програмування, частина 1 Пуйда Д.В., 512 V н.к., Лекція',
                'group2': 'Системне програмування, частина 1 Пуйда Д.В., 512 V н.к., Лекція'},
            2: {'group1': 'Філософія Карівець І.В., 512 V н.к., Лекція',
                'group2': 'Філософія Карівець І.В., 512 V н.к., Лекція'},
            3: {'group1': '',
                'group2': 'Системне програмування, частина 1 Рожак Ю.Р., 510 V н.к., Лабораторна'},
            },
        'Thursday': {
            1: {'group1': 'Системне програмування, частина 1 Рожак Ю.Р., 505б2 V н.к., Лабораторна',
                'group2': ''},
            2: {'group1': 'Системне програмування, частина 1 Рожак Ю.Р., 508 V н.к., Практична',
                'group2': 'Системне програмування, частина 1 Рожак Ю.Р., 508 V н.к., Практична'},
            3: {'group1': 'Комп`ютерна схемотехніка Клушин Ю.С., Паралюх І.П., 512 V н.к., Лекція ',
                'group2': 'Комп`ютерна схемотехніка Клушин Ю.С., Паралюх І.П., 512 V н.к., Лекція'},
            4: {'group1': 'Моделювання комп`ютерних систем Будз І.С., 322 I н.к., Лекція',
                'group2': 'Моделювання комп`ютерних систем Будз І.С., 322 I н.к., Лекція'},
            },
        'Friday' : {
            1: {'group1': 'Алгоритми та моделі обчислень Колодій З.О., 512 V н.к., Лекція',
                'group2': 'Алгоритми та моделі обчислень Колодій З.О., 512 V н.к., Лекція'},
            2: {'group1': 'Організація баз даних Колодчак О.М., 512 V н.к., Лекція',
                'group2': 'Організація баз даних Колодчак О.М., 512 V н.к., Лекція'},
            }
        }

schedule_even = {
        'Monday': {
            3: {'group1': 'Лабораторна Комп`ютерна схемотехніка Клушин Ю.С., 509 V н.к.',
                'group2': 'Організація баз даних Колодчак О.М., 505а1 V н.к.'},
            4: {'group1': 'Організація баз даних Колодчак О.М., 505а1 V н.к.',
                'group2': 'Лабораторна Комп`ютерна схемотехніка Клушин Ю.С., 509 V н.к.'},
            },
       'Tuesday': {
           3: {'group1': 'Моделювання комп`ютерних систем Будз І.С., 505б1 V н.к.',
               'group2': 'Лабораторна Алгоритми та моделі обчислень Колодій З.О., 505б2 V н.к.'},
           4: {'group1': 'Лабораторна Алгоритми та моделі обчислень Колодій З.О., 505б2 V н.к.',
               'group2': 'Моделювання комп`ютерних систем Будз І.С., 505б1 V н.к.'},
            },
       'Wednesday' :{
            1: {'group1': 'Системне програмування, частина 1 Пуйда Д.В., 512 V н.к., Лекція',
                'group2': 'Системне програмування, частина 1 Пуйда Д.В., 512 V н.к., Лекція'},
            2: {'group1': 'Філософія Карівець І.В., 512 V н.к., Лекція',
                'group2': 'Філософія Карівець І.В., 512 V н.к., Лекція'},
            3: {'group1': 'Філософія Карівець І.В., 901 V н.к., Практична',
                'group2': 'Філософія Карівець І.В., 901 V н.к., Практична'},
            },
        'Thursday': {
            3: {'group1': 'Комп`ютерна схемотехніка Клушин Ю.С., Паралюх І.П., 512 V н.к., Лекція',
                'group2': 'Комп`ютерна схемотехніка Клушин Ю.С., Паралюх І.П., 512 V н.к., Лекція'},
            4: {'group1': 'Моделювання комп`ютерних систем Будз І.С., 322 I н.к., Лекція',
                'group2': 'Моделювання комп`ютерних систем Будз І.С., 322 I н.к., Лекція'},
            },
        'Friday' : {
              1: {'group1': 'Алгоритми та моделі обчислень Колодій З.О., 512 V н.к., Лекція',
                'group2': 'Алгоритми та моделі обчислень Колодій З.О., 512 V н.к., Лекція'},
              2: {'group1': 'Організація баз даних Колодчак О.М., 512 V н.к., Лекція',
                'group2': 'Організація баз даних Колодчак О.М., 512 V н.к., Лекція'},
              3: {'group1': 'Комп`ютерна схемотехніка Клушин Ю.С., 512 V н.к., Практична ',
                'group2': 'Комп`ютерна схемотехніка Клушин Ю.С., 512 V н.к., Практична '},
            }
        }

